In [1]:
import pandas as pd

In [2]:
import numpy as np

In [27]:
data = {'name':['a','b','c','d','e','f', np.nan], 'location':['hyd','BLR','BLR','hyd','BOM','bom',np.nan], 'sales':[1000,2000,1000,1500,'15%08', '13$03',np.nan], 'profit':[10,20,30,'2E3','ER34', 40,50]}

In [28]:
df = pd.DataFrame(data)

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
name        6 non-null object
location    6 non-null object
sales       6 non-null object
profit      7 non-null object
dtypes: object(4)
memory usage: 352.0+ bytes

In [6]:
df.isnull().sum()

name        1
location    1
sales       1
profit      0
dtype: int64

In [7]:
df.dropna()

  name location  sales profit
0    a      hyd   1000     10
1    b      BLR   2000     20
2    c      BLR   1000     30
3    d      hyd   1500    2E3
4    e      BOM  15%08   ER34
5    f      bom  13$03     40

In [30]:
df['name'] = df['name'].fillna('g')

In [11]:
df

  name location  sales profit
0    a      hyd   1000     10
1    b      BLR   2000     20
2    c      BLR   1000     30
3    d      hyd   1500    2E3
4    e      BOM  15%08   ER34
5    f      bom  13$03     40
6    g      NaN    NaN     50

In [31]:
#Encoding
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()
encoded = label_encoder.fit(df['name'])
df['name'] = encoded.transform(df['name'])

In [32]:
df

   name location  sales profit
0     0      hyd   1000     10
1     1      BLR   2000     20
2     2      BLR   1000     30
3     3      hyd   1500    2E3
4     4      BOM  15%08   ER34
5     5      bom  13$03     40
6     6      NaN    NaN     50

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
name        7 non-null int64
location    6 non-null object
sales       6 non-null object
profit      7 non-null object
dtypes: int64(1), object(3)
memory usage: 352.0+ bytes

In [34]:
df = df.dropna()
print(df)

   name location  sales profit
0     0      hyd   1000     10
1     1      BLR   2000     20
2     2      BLR   1000     30
3     3      hyd   1500    2E3
4     4      BOM  15%08   ER34
5     5      bom  13$03     40

In [35]:
#One-Hot Encoding for Location
from sklearn.preprocessing import LabelBinarizer

lb = LabelBinarizer()
lb_location = lb.fit_transform(df['location'])

In [36]:
lb_location

array([[0, 0, 0, 1],
       [1, 0, 0, 0],
       [1, 0, 0, 0],
       [0, 0, 0, 1],
       [0, 1, 0, 0],
       [0, 0, 1, 0]])

In [21]:
lb_loc = pd.get_dummies(df['location'])

In [22]:
lb_loc

   BLR  BOM  bom  hyd
0    0    0    0    1
1    1    0    0    0
2    1    0    0    0
3    0    0    0    1
4    0    1    0    0
5    0    0    1    0

In [37]:
df = df.replace('bom', 'BOM')

In [38]:
df

   name location  sales profit
0     0      hyd   1000     10
1     1      BLR   2000     20
2     2      BLR   1000     30
3     3      hyd   1500    2E3
4     4      BOM  15%08   ER34
5     5      BOM  13$03     40

In [44]:
lb_loc = pd.get_dummies(df['location'])

In [47]:
type(lb_loc)

pandas.core.frame.DataFrame

In [48]:
type(df)

pandas.core.frame.DataFrame

In [49]:
df = pd.concat([df,lb_loc], axis = 1)

In [51]:
del df['location']

In [52]:
df

   name  sales profit  BLR  BOM  hyd
0     0   1000     10    0    0    1
1     1   2000     20    1    0    0
2     2   1000     30    1    0    0
3     3   1500    2E3    0    0    1
4     4  15%08   ER34    0    1    0
5     5  13$03     40    0    1    0

In [59]:
df['sales'] = df['sales'].replace(regex= True, to_replace = '[^0-9]', value = '')

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 6 columns):
name      6 non-null int64
sales     6 non-null int64
profit    6 non-null object
BLR       6 non-null uint8
BOM       6 non-null uint8
hyd       6 non-null uint8
dtypes: int64(2), object(1), uint8(3)
memory usage: 210.0+ bytes

In [61]:
df['sales'] = pd.to_numeric(df['sales'])

In [63]:
df['profit'] = df['profit'].replace(regex= True, to_replace = '[^0-9]', value = '')

In [65]:
df['profit'] = pd.to_numeric(df['profit'])

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 6 columns):
name      6 non-null int64
sales     6 non-null int64
profit    6 non-null int64
BLR       6 non-null uint8
BOM       6 non-null uint8
hyd       6 non-null uint8
dtypes: int64(3), uint8(3)
memory usage: 210.0 bytes